Revit 2015 API
IFCWindowStyleOperation Enumeration
 The types of window configurations, as defined in IFC2x3.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2012
Since: 2012
Syntax
C#
[ObsoleteAttribute("This enum is no longer needed for interaction with native code, and has been redefined in Revit.IFC.Export.Toolkit.")]
public enum IFCWindowStyleOperation
Visual Basic
<ObsoleteAttribute("This enum is no longer needed for interaction with native code, and has been redefined in Revit.IFC.Export.Toolkit.")> _
Public Enumeration IFCWindowStyleOperation
Visual C++
[ObsoleteAttribute(L"This enum is no longer needed for interaction with native code, and has been redefined in Revit.IFC.Export.Toolkit.")]
public enum class IFCWindowStyleOperation
Members
Member name | Description
SinglePanel |  Window has a single panel.
DoublePanelVertical |  Window has two vertically stacked panels.
DoublePanelHorizontal |  Window has two panels side to side.
TriplePanelVertical |  Window has three vertically stacked panels.
TriplePanelBottom |  Window has two panels side to side, and one panel below these two.
TriplePanelTop |  Window has two panels side to side, and one panel above these two.
TriplePanelLeft |  Window has two vertically stacked panels, and one panel to the left of these.
TriplePanelRight |  Window has two vertically stacked panels, and one panel to the right of these.
TriplePanelHorizontal |  Window has three panels side to side.
UserDefined |  User-defined window operation.
NotDefined |  Undefined window operation.
See Also
Autodesk.Revit.DB.IFC Namespace